In [1]:
import pandas as pd

In [17]:
#import x and y columns
x = pd.read_csv('/Users/josed.sotorivera/Desktop/Work/UROP Summer 2018/MR_2010_X.csv')
y = pd.read_csv('/Users/josed.sotorivera/Desktop/Work/UROP Summer 2018/MR_2010_Y.csv')

In [18]:
#transpose columns
x = x.T
y = y.T

In [45]:
#make function to add each independently
data = {}
dataa = {}

for i in x.columns:
    data[i] = x[i]
    dataa[i] = y[i]

In [34]:
#Make Data into Dataframes:
exp = pd.DataFrame(data)
exp1 = pd.DataFrame(data)

                    0
Var1      3435.000000
X_   1  302816.005148
X_   2  307582.434849
X_   3  307508.191264
X_   4  298699.250200
X_   5  290762.887185
X_   6  289890.296336
X_   7  289877.109776
X_   8  289873.357328
X_   9  289868.858384
X_  10  287918.640654
X_  11  287579.276814
X_  12  286882.684941
X_  13  286174.805005
X_  14  285928.347660
X_  15  285455.641100
X_  16  285171.279884
X_  17  284573.286923
X_  18  284565.216779
X_  19  285446.616588
X_  20  292023.187474
X_  21  298673.798168
X_  22  302816.005148
X_  23            NaN
X_  24  294540.606996
X_  25  294546.653716
X_  26  294548.653588
X_  27  294547.294740
X_  28  294547.121684
X_  29  294543.835668
...               ...
X_7692            NaN
X_7693            NaN
X_7694            NaN
X_7695            NaN
X_7696            NaN
X_7697            NaN
X_7698            NaN
X_7699            NaN
X_7700            NaN
X_7701            NaN
X_7702            NaN
X_7703            NaN
X_7704            NaN
X_7705            NaN
X_7706            NaN
X_7707            NaN
X_7708            NaN
X_7709            NaN
X_7710            NaN
X_7711            NaN
X_7712            NaN
X_7713            NaN
X_7714            NaN
X_7715            NaN
X_7716            NaN
X_7717            NaN
X_7718            NaN
X_7719            NaN
X_7720            NaN
X_7721            NaN

[7722 rows x 1 columns]

In [35]:
exp.T

,Var1,X_ 1,X_ 2,X_ 3,X_ 4,X_ 5,X_ 6,X_ 7,X_ 8,X_ 9,...,X_7712,X_7713,X_7714,X_7715,X_7716,X_7717,X_7718,X_7719,X_7720,X_7721
0,3435.0,302816.005148,307582.434849,307508.191264,298699.2502,290762.887185,289890.296336,289877.109776,289873.357328,289868.858384,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN